Autodesk.Revit.DB.Structure.AnalyticalSupportPriority
Defines how "highly" another Element is giving support for one Element.
Remarks:
For instance, a Column may be a higher priority for a Beam than another Beam.
This is useful to find the best supports for a given Element.

Autodesk.Revit.DB.Structure.AnalyticalSupportPriority.UnknownPriority
Priority has not been determined.